Autodesk.Revit.DB.LoadedFamilyIntegrityCheck.CheckAllFamiliesSlow(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Check integrity of content documents of all families loaded in the host document.
Remarks:
This check is slow as it invloves traversal of all content documents.
It also dumps data about bad families into the journal, as well as the whole content tree into the dump file.
ADoc:
The host document.
corruptFamilyIds:
Return ids of families that need to be reloaded because their content documents are missing or corrupt.
Returns:
Returns true if all content documents are usable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.LoadedFamilyIntegrityCheck.CheckFamily(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Check that the loaded family has its content document.
ADoc:
The host document.
familyId:
The id of the family to check.
Returns:
Returns true if the family has its content document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.LoadedFamilyIntegrityCheck.CheckAllFamilies(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Check that all families loaded in the host document have their content documents.
ADoc:
The host document.
corruptFamilyIds:
Return ids of families that need to be reloaded because their content documents are missing.
Returns:
Returns true if all loaded families have their content documents.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.LoadedFamilyIntegrityCheck
Functions for checking the integrity of loaded families.